; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	thermograph0 - mode
	infrared2 - mode
	image4 - mode
	thermograph3 - mode
	image7 - mode
	thermograph6 - mode
	thermograph1 - mode
	infrared5 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph6)
	(supports instrument1 image7)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared5)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Star0)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 infrared2)
	(have_image Star6 thermograph0)
	(have_image Planet7 thermograph6)
	(have_image Planet7 image7)
	(have_image Phenomenon8 infrared5)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 infrared2)
	(have_image Planet9 image7)
	(have_image Planet10 infrared5)
	(have_image Star11 image7)
	(have_image Star12 thermograph0)
))

)

; plan
1. (turn_to satellite1 star0 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star0)
   goals met: 1 of 14
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 14
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 1 of 14
4. (turn_to satellite1 planet9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet9)
   goals met: 0 of 14
5. (take_image satellite1 planet9 instrument3 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 1 of 14
6. (turn_to satellite1 planet10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet10)
   goals met: 1 of 14
7. (take_image satellite1 planet10 instrument3 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 14
9. (turn_to satellite0 star0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star0)
   goals met: 2 of 14
10. (take_image satellite1 phenomenon8 instrument3 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 3 of 14
11. (take_image satellite1 phenomenon8 instrument3 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 4 of 14
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 14
13. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 4 of 14
14. (turn_to satellite0 phenomenon5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 14
15. (take_image satellite0 phenomenon5 instrument0 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 5 of 14
16. (turn_to satellite0 star12 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star12)
   goals met: 5 of 14
17. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 6 of 14
18. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 6 of 14
19. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 7 of 14
20. (turn_to satellite1 star6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star6)
   goals met: 7 of 14
21. (take_image satellite1 star6 instrument3 infrared2)
   added: (have_image star6 infrared2)
   goals met: 8 of 14
22. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 8 of 14
23. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 8 of 14
24. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   goals met: 8 of 14
25. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 8 of 14
26. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   goals met: 8 of 14
27. (take_image satellite1 planet7 instrument1 image7)
   added: (have_image planet7 image7)
   goals met: 9 of 14
28. (take_image satellite1 planet7 instrument1 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 10 of 14
29. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 10 of 14
30. (take_image satellite1 planet9 instrument1 image7)
   added: (have_image planet9 image7)
   goals met: 11 of 14
31. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 11 of 14
32. (take_image satellite1 star11 instrument1 image7)
   added: (have_image star11 image7)
   goals met: 12 of 14
33. (turn_to satellite1 star0 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star0)
   goals met: 13 of 14
34. (turn_to satellite2 star0 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star0)
   goals met: 14 of 14
